In [7]:
import pandas as pd
data = [(1,'varun',30,'male','chandigarh'),
        (2,'sachin',40,'female','mumbai'),
        (3,'rahul',25,'male','delhi'),
        (4,'suresh',34,'female','kolkata')]
df = pd.DataFrame(data, columns=['id','name','age','gender','city'])
df

   id    name  age  gender        city
0   1   varun   30    male  chandigarh
1   2  sachin   40  female      mumbai
2   3   rahul   25    male       delhi
3   4  suresh   34  female     kolkata